import { 五行 } from 'src/app/enums/五行.enum';
import { 地支 } from 'src/app/enums/地支.enum';
import { 天干 } from 'src/app/enums/天干.enum';

export const 天干列: 天干[] = [
  天干.甲,
  天干.乙,
  天干.丙,
  天干.丁,
  天干.戊,
  天干.己,
  天干.庚,
  天干.辛,
  天干.壬,
  天干.癸,
];

export const 地支列: 地支[] = [
  地支.子,
  地支.丑,
  地支.寅,
  地支.卯,
  地支.辰,
  地支.巳,
  地支.午,
  地支.未,
  地支.申,
  地支.酉,
  地支.戌,
  地支.亥,
];

export const 陽列: (天干 | 地支)[] = [
  地支.寅,
  地支.午,
  地支.辰,
  地支.戌,
  地支.申,
  地支.子,
  天干.甲,
  天干.丙,
  天干.戊,
  天干.庚,
  天干.壬,
];

export const 陰列: (天干 | 地支)[] = [
  地支.卯,
  地支.巳,
  地支.丑,
  地支.未,
  地支.酉,
  地支.亥,
  天干.乙,
  天干.丁,
  天干.己,
  天干.辛,
  天干.癸,
];

export const 天干合 = new Map([
  [天干.甲, 天干.己],
  [天干.乙, 天干.庚],
  [天干.丙, 天干.辛],
  [天干.丁, 天干.壬],
  [天干.戊, 天干.癸],
  [天干.己, 天干.甲],
  [天干.庚, 天干.乙],
  [天干.辛, 天干.丙],
  [天干.壬, 天干.丁],
  [天干.癸, 天干.戊],
]);

export const 地支合 = new Map([
  [地支.子, 地支.丑],
  [地支.寅, 地支.亥],
  [地支.卯, 地支.戌],
  [地支.辰, 地支.酉],
  [地支.巳, 地支.申],
  [地支.午, 地支.未],
  [地支.丑, 地支.子],
  [地支.亥, 地支.寅],
  [地支.戌, 地支.卯],
  [地支.酉, 地支.辰],
  [地支.申, 地支.巳],
  [地支.未, 地支.午],
]);

export const 五行轉換 = (天干地支: 天干 | 地支) => {
  switch (天干地支) {
    case 天干.甲:
    case 天干.乙:
    case 地支.寅:
    case 地支.卯:
      return 五行.木;
    case 天干.丙:
    case 天干.丁:
    case 地支.午:
    case 地支.巳:
      return 五行.火;
    case 天干.戊:
    case 天干.己:
    case 地支.辰:
    case 地支.戌:
    case 地支.丑:
    case 地支.未:
      return 五行.土;
    case 天干.庚:
    case 天干.辛:
    case 地支.申:
    case 地支.酉:
      return 五行.金;
    case 天干.壬:
    case 天干.癸:
    case 地支.子:
    case 地支.亥:
      return 五行.水;
  }
};
